Repository: MikeBrockschmidt/famka_app
Catalog: lib/l10n/app_*.arb
Languages: de

# addOrJoinGroupRequiredFieldError
source: Please fill out all required fields.
de: Bitte füllen Sie alle erforderlichen Felder aus.

# addOrJoinGroupTitle
source: Create Group
de: Gruppe erstellen

# addOrJoinGroupCreateHint
source: Enter a group name
de: Gruppenname eingeben

# addOrJoinGroupGroupNameEmpty
source: Please enter a group name.
de: Bitte geben Sie einen Gruppennamen ein.

# addOrJoinGroupDescriptionHint
source: A short description of your group
de: Eine kurze Beschreibung Ihrer Gruppe

# addOrJoinGroupLocationHint
source: Where is your group located?
de: Wo befindet sich Ihre Gruppe?

# addOrJoinGroupCreateButton
source: Create Group
de: Gruppe erstellen

# addPassiveMemberTitle
source: Add Passive Member
de: Passives Mitglied hinzufügen

# addPassiveMemberFirstNameLabel
source: First Name
de: Vorname

# addPassiveMemberLastNameLabel
source: Last Name
de: Nachname

# addPassiveMemberLastNameError
source: Please enter a last name.
de: Bitte geben Sie einen Nachnamen ein.

# addPassiveMemberFirstNameError
source: Please enter a first name.
de: Bitte geben Sie einen Vornamen ein.

# addPassiveMemberAddButton
source: Add
de: Hinzufügen

# addPassiveMemberCancelButton
source: Cancel
de: Abbrechen

# addPassiveMemberSuccess
source: {firstName} has been successfully added.
de: {firstName} wurde erfolgreich hinzugefügt.

# addPassiveMemberError
source: Failed to add member: {error}
de: Fehler beim Hinzufügen des Mitglieds: {error}

# enterLocationHint
source: Enter location
de: Ort eingeben

# enterDescriptionHint
source: Enter description
de: Beschreibung eingeben

# groupPageRoleAdmin
source: Role: Admin
de: Rolle: Admin

# groupPageRoleMember
source: Role: Member
de: Rolle: Mitglied

# shareGroupIdInstruction
source: Share this Group ID with others so they can join the group:
de: Teilen Sie diese Gruppen-ID mit anderen, damit sie der Gruppe beitreten können:

source: Group ID copied!
de: Gruppen-ID kopiert!

# copyButton
source: Copy
de: Kopieren

# newGroupTitle
source: Group
de: Neue Gruppe erstellen

# enterGroupName
source: Please enter a group name.
de: Bitte geben Sie einen Gruppennamen ein.

# groupCreatedSuccess
source: Group "{groupName}" successfully created!
de: Gruppe "{groupName}" erfolgreich erstellt!

# createGroupError
source: Error creating group: {error}
de: Fehler beim Erstellen der Gruppe: {error}

# groupNameLabel
source: Group Name
de: Gruppenname

# locationLabel
source: Location
de: Ort

# descriptionLabel
source: Description
de: Beschreibung

# createButtonText
source: Create
de: Erstellen

# noCurrentUserError
source: Error: No current user available. Please sign in.
de: Fehler: Kein angemeldeter Benutzer verfügbar. Bitte melden Sie sich an.

# noActiveGroupError
source: Could not load any groups or no active group to display.
de: Es konnten keine Gruppen geladen werden oder es ist keine aktive Gruppe vorhanden.

# loadingGroupsError
source: Error loading groups: {error}
de: Fehler beim Laden der Gruppen: {error}

# groupsDeletedError
source: All groups have been deleted or could not be loaded.
de: Alle Gruppen wurden gelöscht oder konnten nicht geladen werden.

# unknownError
source: An unknown error occurred.
de: Ein unbekannter Fehler ist aufgetreten.

# createGroupNotImplemented
source: Create group function not yet implemented.
de: Gruppen-Erstellungsfunktion noch nicht implementiert.

# createGroupButtonText
source: Create New Group
de: Neue Gruppe erstellen

# calendarTitle
source: Calendar
de: Kalender

# groupsTitle
source: Groups
de: Gruppen

# loadingErrorWithDetails
source: Loading Error: {error}
de: Fehler beim Laden: {error}

# noGroupsJoined
source: You haven't joined any groups yet.
de: Sie sind noch keiner Gruppe beigetreten.

# imprintTitle
source: Imprint
de: Impressum

# languageTitle
source: Setup
de: Sprache

# languageSettingTitle
source: Select Language
de: Sprache auswählen

# languageGerman
source: German
de: Deutsch

# languageEnglish
source: English
de: Englisch

# loginScreenTitle
source: Login
de: Anmeldung

# emailInputLabel
source: Email Address
de: E-Mail-Adresse

# emailInputHint
source: Enter email address
de: E-Mail-Adresse eingeben

# passwordInputLabel
source: Password
de: Passwort

# passwordInputHint
source: Enter password
de: Passwort eingeben

# checkInputsError
source: Please check your inputs.
de: Bitte überprüfen Sie Ihre Eingaben.

# loginButtonText
source: Login
de: Anmelden

# newHereButtonText
source: New here? Follow me!
de: Neu hier? Folgen Sie mir!

# notRegisteredYetText
source: I'm not registered yet!
de: Ich bin noch nicht registriert!

# firebaseUserNotFound
source: User not found in Firebase.
de: Benutzer nicht in Firebase gefunden.

# firestoreUserNotFound
source: User data not found in Firestore.
de: Benutzerdaten nicht in Firestore gefunden.

# loginFailedGeneric
source: Login failed: {message}
de: Anmeldung fehlgeschlagen: {message}

# loginFailedUserNotFound
source: No user found for this email.
de: Kein Benutzer für diese E-Mail-Adresse gefunden.

# loginFailedWrongPassword
source: Wrong password for this email.
de: Falsches Passwort für diese E-Mail-Adresse.

# googleLoginFailedNoUser
source: Google login failed: No Firebase user received.
de: Google-Anmeldung fehlgeschlagen: Kein Firebase-Benutzer erhalten.

# googleLoginNewUserCreated
source: New Google user profile created.
de: Neues Google-Benutzerprofil erstellt.

# googleLoginSuccess
source: Google user logged in successfully.
de: Google-Benutzer erfolgreich angemeldet.

# googleLoginExistingUser
source: Google user found in Firestore: {uid}
de: Google-Benutzer in Firestore gefunden: {uid}

# googleLoginFailedFirestoreLoad
source: Error: Could not load user data after creation.
de: Fehler: Benutzerdaten konnten nach der Erstellung nicht geladen werden.

# googleLoginFailedDifferentCredential
source: An account already exists with this email but with a different sign-in method.
de: Ein Konto mit dieser E-Mail-Adresse existiert bereits, aber mit einer anderen Anmeldemethode.

# googleLoginAborted
source: Google login aborted by user.
de: Google-Anmeldung vom Benutzer abgebrochen.

# googleLoginUnexpectedError
source: Unexpected Google login error: {error}
de: Unerwarteter Fehler bei der Google-Anmeldung: {error}

# signInWithGoogleTooltip
source: Sign in with Google
de: Mit Google anmelden

# signInWithAppleNotImplemented
source: Apple login not yet implemented.
de: Apple-Anmeldung noch nicht implementiert.

# signInWithAppleTooltip
source: Sign in with Apple
de: Mit Apple anmelden

# emailValidationEmpty
source: Email address cannot be empty
de: E-Mail-Adresse darf nicht leer sein

# emailValidationInvalid
source: Please enter a valid email address.
de: Bitte geben Sie eine gültige E-Mail-Adresse ein.

# passwordValidationMinLength
source: Min. 8 characters
de: Mind. 8 Zeichen

# passwordValidationMaxLength
source: Max. 50 characters
de: Max. 50 Zeichen

# passwordValidationLowercase
source: Min. one lowercase letter
de: Mind. ein Kleinbuchstabe

# passwordValidationUppercase
source: Min. one uppercase letter
de: Mind. ein Großbuchstabe

# passwordValidationDigit
source: Min. one digit
de: Mind. eine Ziffer

# passwordValidationSpecialChar
source: Min. one special character
de: Mind. ein Sonderzeichen

# appointmentTitle
source: Appointment
de: Termin

# appointmentTitleLabel
source: Appointment Title
de: Termintitel

# appointmentTitleHint
source: Appointment Title
de: Termintitel

# dateLabel
source: Date
de: Datum

# dateHint
source: YYYY-MM-DD
de: JJJJ-MM-TT

# allDayLabel
source: All Day
de: Ganztägig

# startTimeLabel
source: Start Time
de: Startzeit

# endTimeLabel
source: End Time
de: Endzeit

# locationHint
source: Appointment Location
de: Terminort

# descriptionHint
source: Details about the appointment (optional)
de: Details zum Termin (optional)

# createdByUser
source: Created by: {creator}
de: Erstellt von: {creator}

# forGroup
source: For Group: {groupName}
de: Für Gruppe: {groupName}

# validatorTitleEmpty
source: Please enter a title
de: Bitte geben Sie einen Titel ein

# validatorTitleLength
source: Maximum 80 characters allowed
de: Maximal 80 Zeichen erlaubt

# validatorTitleEmojis
source: No emojis allowed
de: Keine Emojis erlaubt

# validatorLocationEmpty
source: Please enter a location
de: Bitte geben Sie einen Ort ein

# validatorLocationInvalidChars
source: Invalid characters in location
de: Ungültige Zeichen im Ort

# validatorDescriptionLength
source: Maximum 500 characters allowed
de: Maximal 500 Zeichen erlaubt

# validatorRepeatCountEmpty
source: Please enter a number
de: Bitte geben Sie eine Zahl ein

# validatorRepeatCountInvalid
source: Invalid number (must be > 0)
de: Ungültige Zahl (muss > 0 sein)

# validatorRepeatCountMax
source: Max. 365 repetitions
de: Max. 365 Wiederholungen

# snackbarFillAllFields
source: Please fill out all fields correctly.
de: Bitte füllen Sie alle Felder korrekt aus.

# snackbarAddImage
source: Please give your event a face.
de: Bitte geben Sie Ihrem Ereignis ein Gesicht.

# snackbarSelectParticipants
source: For whom is the appointment? Please select at least one participant.
de: Für wen ist der Termin? Bitte wählen Sie mindestens einen Teilnehmer aus.

# snackbarDateParseError
source: Error parsing date or time.
de: Fehler beim Parsen von Datum oder Uhrzeit.

# snackbarCreatorError
source: Error: Could not determine appointment creator.
de: Fehler: Terminersteller konnte nicht ermittelt werden.

# snackbarRecurringEventSaved
source: Event series saved!
de: Terminserie gespeichert!

# snackbarSingleEventSaved
source: Event saved!
de: Termin gespeichert!

# snackbarSaveError
source: Error saving event: {error}
de: Fehler beim Speichern des Termins: {error}

# repeatDaily
source: Daily
de: Täglich

# repeatWeekly
source: Weekly
de: Wöchentlich

# repeatMonthly
source: Monthly
de: Monatlich

# repeatYearly
source: Yearly
de: Jährlich

# reminderOneHour
source: 1 hour
de: 1 Stunde

# reminderOneDay
source: 1 day
de: 1 Tag

# reminder30Minutes
source: 30 minutes
de: 30 Minuten

# validateDateEmpty
source: Please select a date
de: Bitte wählen Sie ein Datum aus

# validateDateInvalid
source: Invalid date
de: Ungültiges Datum

# validateDateInPast
source: Date cannot be in the past
de: Datum kann nicht in der Vergangenheit liegen

# validateTimeEmpty
source: Please enter time
de: Bitte geben Sie eine Zeit ein

# validateTimeInvalid
source: Invalid time
de: Ungültige Zeit

# eventParticipantsTitle
source: For whom is the appointment?
de: Für wen ist der Termin?

# errorLoadingMembers
source: Error: {error}
de: Fehler: {error}

source: No members found.
de: Keine Mitglieder gefunden.

# addImageTitle
source: Add photo or pictogram
de: Foto oder Piktogramm hinzufügen

# addImageDescription
source: The selected image will replace the event's title in the calendar view.
de: Das ausgewählte Bild ersetzt den Titel des Termins in der Kalenderansicht.

# repeatLabel
source: Repeat
de: Wiederholen

# repeatDropdownLabel
source: Repetition
de: Wiederholung

# numberOfRepeatsLabel
source: Number of repetitions
de: Anzahl der Wiederholungen

# numberOfRepeatsHint
source: e.g., 5 (incl. this event)
de: z.B. 5 (inkl. diesem Termin)

# reminderLabel
source: Reminder
de: Erinnerung

# reminderBeforeLabel
source: Reminder before
de: Erinnerung vor

# saveButtonText
source: Save
de: Speichern

# groupAvatarLoadingError
source: Error loading group avatar: {error}
de: Fehler beim Laden des Gruppen-Avatars: {error}

# singleEventAvatarLoadingError
source: Error loading avatar in SingleEventAvatar: {error}
de: Fehler beim Laden des Avatars in SingleEventAvatar: {error}

# imageUploadSuccess
source: Image successfully uploaded and updated.
de: Bild erfolgreich hochgeladen: {downloadUrl}

# imageDeletedSuccess
source: Image successfully deleted.
de: Bild erfolgreich gelöscht.

# imageDeleteError
source: Error deleting image: {error}
de: Fehler beim Löschen des Bildes: {error}

# imageUploadAborted
source: Image upload aborted or failed.
de: Bild-Upload abgebrochen oder fehlgeschlagen.

# imageUploadError
source: Error during image upload: {error}
de: Fehler beim Bild-Upload: {error}

# menuTitle
source: Menu
de: Menü

# manageMembersUpdateSuccess
source: Members updated successfully.
de: Mitglieder erfolgreich aktualisiert.

# manageMembersUpdateError
source: Failed to update members: {error}
de: Fehler beim Aktualisieren der Mitglieder: {error}

# manageMembersTitle
source: Manage Members
de: Mitglieder verwalten

# manageMembersCurrentTitle
source: Current Members
de: Aktuelle Mitglieder

# manageMembersRoleMember
source: (Member)
de: (Mitglied)

# manageMembersRolePassive
source: (Passive)
de: (Passiv)

# manageMembersNoEmailPhone
source: No email/phone number
de: Keine E-Mail/Telefonnummer

# manageMembersSavingButton
source: Saving...
de: Wird gespeichert...

# manageMembersSaveChangesButton
source: Save Changes
de: Änderungen speichern

# galleryLabel
source: Gallery
de: Galerie

# passwordShowTooltip
source: Show password
de: Passwort anzeigen

# passwordHideTooltip
source: Hide password
de: Passwort verbergen

# noGroupSelectedError
source: Please create or join a group to use this feature.
de: Bitte erstellen oder treten Sie einer Gruppe bei, um diese Funktion zu nutzen.

# noUserDataError
source: No user data available.
de: Keine Benutzerdaten verfügbar.

# errorLoadingAvatar
source: Error loading avatar from {avatarUrl}: {exception}
de: Fehler beim Laden des Avatars von {avatarUrl}: {exception}

# errorLoadingGroupAvatar
source: Error loading group avatar in ProfilAvatarRow: {exception}
de: Fehler beim Laden des Gruppen-Avatars in ProfilAvatarRow: {exception}

# cropImageTitle
source: Crop Image
de: Bild zuschneiden

source: ❌ Compression failed.
de: ❌ Komprimierung fehlgeschlagen.

# uploadSuccess
source: ✅ Image successfully uploaded to Firebase Storage: {downloadUrl}
de: ✅ Bild erfolgreich zu Firebase Storage hochgeladen: {downloadUrl}

# uploadError
source: ❌ Error uploading image: {state}
de: ❌ Fehler beim Hochladen des Bildes: {state}

# errorLoadingActiveGroup
source: Error loading active group: {error}
de: Fehler beim Laden der aktiven Gruppe: {error}

# saveButton
source: Save
de: Speichern

# logoutButton
source: Logout
de: Ausloggen

# addGroupButton
source: Add Group
de: Gruppe hinzufügen

# invalidEmailError
source: Invalid email address
de: Ungültige E-Mail Adresse

# invalidPhoneNumberError
source: Invalid phone number (min. 8 digits, numbers only)
de: Ungültige Telefonnummer (min. 8 Ziffern, nur Zahlen)

source: Profile picture updated.
de: Profilbild aktualisiert.

# profilePictureUpdateError
source: Error updating profile picture:
de: Fehler beim Aktualisieren des Profilbilds:

# profileInfoSaved
source: Profile information saved.
de: Profilinformationen gespeichert.

# profileInfoSaveError
source: Error saving profile information:
de: Fehler beim Speichern der Profilinformationen:

# logoutError
source: Error logging out:
de: Fehler beim Abmelden:

# profileIdTitle
source: Your Profile ID
de: Deine Profil-ID

# profileIdDescription
source: This is your personal ID. You can share it with others so they can invite you to groups.
de: Dies ist deine persönliche ID. Du kannst sie mit anderen teilen, damit sie dich zu Gruppen einladen können.

source: Profile ID copied!
de: Profil-ID kopiert!

# closeButton
source: Close
de: Schließen

source: Enter phone number
de: Telefonnummer eingeben

source: Additional info
de: Zusätzliche Infos

source: Enter email address
de: E-Mail Adresse eingeben

# onboardingComplete
source: Data has been saved and onboarding completed.
de: Daten wurden gespeichert und Onboarding abgeschlossen.

# telefonnummerEingeben
source: Enter phone number
de: Telefonnummer eingeben

# emailAdresseEingeben
source: Enter email address
de: E-Mail Adresse eingeben

# zusaetzlicheInfos
source: Additional info
de: Zusätzliche Infos

# keineGruppenGefunden
source: No groups found.
de: Keine Gruppen gefunden.

# ungueltigeEmail
source: Invalid email address
de: Ungültige E-Mail-Adresse

# profilGesichtGeben
source: Give your profile a face
de: Geben Sie Ihrem Profil ein Gesicht

# fillRequiredFields
source: Please fill in all required fields
de: Bitte füllen Sie alle erforderlichen Felder aus.

source: Group Name
de: Gruppenname

source: Group Description
de: Gruppenbeschreibung

# groupLocation
source: Location
de: Ort

# inviteUserPrompt
source: Enter the profile ID of the user you want to invite
de: Geben Sie die Profil-ID des Benutzers ein, den Sie einladen möchten

# userProfileIdHint
source: Enter user profile ID
de: Benutzerprofil-ID eingeben

# enterProfileIdError
source: Please enter a valid profile ID
de: Bitte geben Sie eine gültige Profil-ID ein

# addButtonText
source: Add
de: Hinzufügen

# cancelButtonText
source: Cancel
de: Abbrechen

source: Delete Appointment
de: Termin löschen

# confirmDeleteAppointment
source: Do you really want to delete "{eventName}" permanently?
de: Möchten Sie "{eventName}" wirklich dauerhaft löschen?

source: Edit Description
de: Beschreibung bearbeiten

# participants
source: Participants: {names}
de: Teilnehmer

# menuLabel
source: Menu
de: Menü

# calendarLabel
source: Calendar
de: Kalender

# appointmentLabel
source: Appointment
de: Termin

# piktogrammeLabe
source: Pictograms
de: Piktogramme

# fortfahren
source: Continue
de: Fortfahren

# vorname
source: First Name
de: Vorname

# bitteVornameEingeben
source: Please enter first name
de: Bitte Vorname eingeben

# nachname
source: Last Name
de: Nachname

# nachnameEingeben
source: Enter last name
de: Nachname eingeben

# bitteNachnameEingeben
source: Please enter last name
de: Bitte Nachname eingeben

# emailAdresse
source: Email Address
de: E-Mail-Adresse

# telefonnummerOptional
source: Phone Number (optional)
de: Telefonnummer (optional)

# groupDeletedSuccess
source: Group "{groupName}" successfully deleted.
de: Gruppe "{groupName}" erfolgreich gelöscht.

# groupDeleteError
source: Error deleting group: {error}
de: Fehler beim Löschen der Gruppe: {error}

# userInviteError
source: Error inviting user: {error}
de: Fehler beim Einladen des Benutzers: {error}

# userNotFound
source: User with this ID not found.
de: Benutzer mit dieser ID nicht gefunden.

# userAlreadyMember
source: User is already a member of this group.
de: Benutzer ist bereits Mitglied dieser Gruppe.

# membersManagementComplete
source: Members management completed.
de: Mitgliederverwaltung abgeschlossen.

# groupAvatarUpdateError
source: Error saving group avatar: {error}
de: Fehler beim Speichern des Gruppenbilds: {error}

# groupAvatarUpdateSuccess
source: Group avatar successfully updated!
de: Gruppenbild erfolgreich aktualisiert!

# debugAvatarChange
source: DEBUG: _onAvatarChanged in GroupPage called with newAvatarUrl: {newAvatarUrl}
de: DEBUG: _onAvatarChanged in GroupPage aufgerufen mit newAvatarUrl: {newAvatarUrl}

source: Changes saved!
de: Änderungen gespeichert!

# groupDataLoadError
source: Error loading group data or user ID: {error}
de: Fehler beim Laden der Gruppendaten oder Benutzer-ID: {error}

# groupLoadError
source: Error: Group could not be loaded or user ID is missing.
de: Fehler: Gruppe konnte nicht geladen werden oder Benutzer-ID fehlt.

source: Members
de: Mitglieder
